Repository: advancedresearch/lojban
Catalog: assets/en-jbo.tmx
Source language: en
Languages: jbo

source: There are no clocks in my room.
jbo: no da junla ne'i lo mi kumfa

source: The maid is confined to her bed.
jbo: lo nimse'u cu diklo lo ri ckana

source: Stir the soup.
jbo: ko jiclygau lo stasu

source: I'm to the east of the west.
jbo: mi stuna lo stici

source: I am west of the east.
jbo: mi stici lo stuna

source: I am south of the north.
jbo: mi snanu lo berti

source: I didn't know it was there
jbo: mi na djuno lo du'u ra zvati

source: I'm waiting for the train.
jbo: mi denpa tu'a lo trene

source: The path is the goal.
jbo: lo pluta cu terzu'e

source: Where has she come from?
jbo: ma pu te se klama ra

source: That girl who wears a scarf is virgin.
jbo: ta poi nixli gi'e dasni lo sruta'u cu nu'ogle

source: It's said that these floods are related to the presence of a god in the area.
jbo: cusku lo se du'u loi vi gairjaudu'e cu srana lo nu lo cevni za zvati

source: I don't know who should guide me.
jbo: mi na djuno lo du'u lo nu ma kau gidva mi cu xamgu

source: I want to have dinner at a restaurant.
jbo: mi djica tu'a lo vacysai bu'u lo gusta

source: He greets everyone loudly.
jbo: ra cladu rinsa lo ro prenu

source: I find it amazing that in the Slavic languages the word sweet originally meant salty!
jbo: mi manci lo nu bau za'u lo slovo bangu lo valsi be lo titla tasta ca lo cfari pu valsi lo silna tasta vau sai

source: I'm on my way.
jbo: mi ca cliva

source: Thank you very, very much!
jbo: ckire do fi'o mutce sai

source: When will you return?
jbo: ca ma ro do se'ixru

source: Almost all workers refused to work during the night.
jbo: so'a lo gunka cu fapro fi lo nu gunka ca lo nicte

source: She didn't go there yesterday.
jbo: ra na klama ca lo prulamdei

source: Have you got a car?
jbo: xu do ralte da poi karce

source: She didn't go yesterday.
jbo: ra na klama ca lo prulamdei

source: I don't have a computer at home.
jbo: mi na ralte lo skami be bu'u le zdani

source: I can respond to his question.
jbo: mi ka'e spuda lo preti be fi ra

source: I'm happy.
jbo: mi gleki

source: There were strange things happening there.
jbo: lo cizra pu va fasnu

source: I had to study English.
jbo: mi pu bilga lo nu tadni lo glibau

source: Wow, these are tasty doughnuts!
jbo: .ua.uicai kukte jintitnanba

source: Feel free to take this.
jbo: .e'icu'i lebna ti

source: Time: That which man is always trying to kill, but which ends in killing him.
jbo: lo temci zo'u lo prenu ro roi troci lo nu catra .i ku'i za ba'o catra py

source: It is all Greek to me.
jbo: ro ti itkuile ga'a mi

source: Her silence surprised me.
jbo: lo nu ra smaji cu spaji mi

source: His silence surprised me.
jbo: lo nu ra smaji cu spaji mi

source: This is my cat.
jbo: lo vi mlatu cu selpo'e mi

source: He is at her side.
jbo: ra mlana ra

source: He's at her side.
jbo: ra mlana ra

source: I asked him if I could read his book.
jbo: mi retsku lo jei ka'e tcidu lo ra cusku kei ra

source: He studies Chinese as well.
jbo: lo nakni cu tadni lo banzuxe'o ji'a

source: Doesn't it look like a mirror?
jbo: xu na simsa lo minra

source: Stay quiet for a moment.
jbo: ko ze'i smaji

source: Don't be foolish.
jbo: ko na bebna

source: He sat down and read the paper.
jbo: ko'a pu tsebi'o gi'e pu tcidu fi lo plekarni

source: Do you think it'll work?
jbo: do kanpe lo nu snada kei fi ma

source: I'm beautiful.
jbo: mi melbi

source: Her legs are long.
jbo: clani tuple ra

source: No, I agree.
jbo: na go'i ie

source: His dad calls him Tom.
jbo: zo tom. cmene ra lo ri patfu

source: My friend is studying Korean.
jbo: lo pendo be mi cu tadni lo bangrgogurio

source: I don't like pepperoni pizza very much.
jbo: mi na nelci lo iptsa be la peperonis

source: I'm in the car.
jbo: mi nenri lo karce

source: Don't threaten me.
jbo: ko na capti'i fi mi

source: I don't want to go to bed.
jbo: .aunai mi ckakla

source: I have gone.
jbo: mi pu klama

source: It rained this afternoon.
jbo: carvi ca lo zi lecydo'i

source: I'm tired of translating.
jbo: mi tatpi lo nu fanva

source: There is no dog which is bigger than this one.
jbo: no gerku cu zmadu ti lo ka barda

source: She's my daughter.
jbo: ta me mi tixnu

source: She is my daughter.
jbo: pa ta me mi tixnu

source: It is midday.
jbo: ca donri midju

source: The men are eating lunch.
jbo: loi nanmu ca citka lo dormijysai

source: This book isn't mine.
jbo: lo vi cukta na srana mi

source: My father is my friend because he gives me a lot of toys.
jbo: lo patfu be mi mi pendo mu'i lo du'u py. dunda so'i selkei mi

source: His father is Japanese.
jbo: lo patfu be ra cu ponjo

source: How romantic!
jbo: .iu pa'irmu'i

source: We're not cold.
jbo: mi'a na lenku

source: How is the family doing?
jbo: le lanzu ca mo

source: He was wearing a tuxedo.
jbo: pu dasni lo taksido

source: Klabaster and Gizmo are cats.
jbo: la'o cy. Klabaster .cy .e la'o cy. Gizmo .cy mlatu

source: How many times have you gone?
jbo: do ra xo roi ba'o klama

source: My native language is the most beautiful gift from my mother.
jbo: lo mamta bangu be mi melbi traji seldu'a lo mamta be mi

source: Can you fix my broken tire now?
jbo: xu do ca ka'e cikre lo mi porpi xilckabu

source: My hair is light brown.
jbo: mi se kerfa lo kadbu'e

source: He doesn't know that I'm Japanese.
jbo: ra na djuno lo du'u mi ponjo

source: She doesn't know that I'm Japanese.
jbo: ra na djuno lo du'u mi ponjo

source: Why am I adding this sentence?
jbo: mu'i ma mi jmina lo vi jufra

source: I have a pair of mittens.
jbo: mi ralte lo remei be lo gluta

source: I kiss with my eyes open.
jbo: lo mi kanla cu kalri ca lo nu mi cinba

source: I have to say no to you.
jbo: ie nai ei

source: You chatter too much.
jbo: do dukse tavla

source: What has he done today?
jbo: mo'u mo ca lo cabdei

source: What has she done today?
jbo: mo'u mo ca lo cabdei

source: What have they done today?
jbo: mo'u mo ca lo cabdei

source: I am a woman.
jbo: mi ninmu

source: The fool is happy.
jbo: lo bebna cu gleki

source: Whatever happens is okay with me.
jbo: ro jalge cu mansa mi

source: I love snow.
jbo: mi prami lo snime

source: My father is in the garden.
jbo: lo mi patfu cu zvati lo purdi

source: Who's that?
jbo: ma du lo va prenu

source: Gold weighs more than iron.
jbo: lo solji cu tilju semau lo tirse

source: Great! The coffee is hot.
jbo: .uisai le ckafi cu glare

source: Do you have a Japanese magazine?
jbo: xu do ralte lo ponjo karni

source: The room was hot.
jbo: le kumfa pu glare

source: Absolutely nothing is permanent in life.
jbo: no da ze'u vitno ca lo nu jmive

source: I'm following the plans made by congress.
jbo: mi tinbe le platu le sorgu'etru

source: My uncle's car is faster than mine.
jbo: lo karce pe lo famti be mi cu sutra zmadu lo mi co'e

source: Shall we wait for you here?
jbo: .aupei mi'a vi denpa tu'a do

source: David is at home.
jbo: la .deivid. zvati lo zdani be vo'a

source: He must be out.
jbo: ja'o ko'a nalzvati

source: I saw Liz this morning.
jbo: mi viska la .liz. ca lo cerni be lo cabdei

source: You really should get this agreement down in writing.
jbo: .e'usai gau ko lo nu tugni ku te vreji

source: Bill took his little brother to the zoo.
jbo: la .bil. pu xlura lo citmau bruna be vo'a tu'a lo mivdalmuzga

source: He gets up at seven.
jbo: ra co'a cikna ti'u li ze

source: She gets up at seven.
jbo: ra co'a cikna ti'u li ze

source: If you don't want to hurt her feelings you're going to have to bend the truth a little.
jbo: mu'i da'i lo nu tu'a do na cnixai ko'a kei do bilga lo nu toltce krori'a pe'a lo jetnu

source: Today, I'm going to talk about the importance of sport in modern society.
jbo: ca lo cabdei mi ba tavla fi lo ka te vajni lo cabna kluce'u lo xadykelci'e

source: Before David arrived, Samantha started to lay the table.
jbo: pu lo nu la .deivid. cu tolcliva kei la .samantas. co'a bregau lo jubme

source: The hooker is old.
jbo: lo gleve'u cu tolci'o

source: Last night I read a book.
jbo: ca lo prulamcte mi tcidu lo cukta

source: I read a book last night.
jbo: mi tcidu lo cusku ca lo prulamcte

source: I read the book last night.
jbo: ca lo prulamcte mi tcidu lo cukta

source: Hopefully he will be healthy soon.
jbo: .a'o ko'a ba zi kanro

source: We aim at that objective.
jbo: mi'ai zukte fi da bi'unai

source: Japanese people in general are polite.
jbo: lo ponjo prenu cu clite

source: He threw his toy.
jbo: ra renro lo vo'a selkei

source: Go back to the seat.
jbo: ko se'ixru lo se zutse

source: Did you watch this movie?
jbo: xu do pu mencti lo vi skina

source: When did the error occur?
jbo: ca ma se srera

source: What did the experimental set-up look like? What was connected to what and how?
jbo: ma pu stura lo te ciplanli .i ma jorne ma ta'i ma

source: Did the error occur right from the start or later on? - When?
jbo: se srera co'a je'i baza zo'e .ibo ca ma go'i

source: How is the error observed?
jbo: ma te zgana lo se srera

source: Does the error occur regularly or sporadically? Is the error reproducible?
jbo: di'i je'i di'inai se srera .ibo xu za'ure'u se gasnu

source: Please, give me something to eat.
jbo: .e'o ko dunda lo se citka mi

source: I hope I dream of you tonight.
jbo: a'o mi senva tu'a do ca lo cabycte

source: I study.
jbo: mi tadni

source: The father is good.
jbo: lo patfu cu xamgu

source: I don't eat the core of an apple.
jbo: mi na citka lo mijypau be lo plise

source: It's warm today.
jbo: milxe glare de'i li no

source: I can't speak Kannada.
jbo: mi na se bangu lo banku'anu

source: It was interesting to hear about school life in Britain.
jbo: .i tu'a lo brito nu tadni pu cinri

source: The garden is behind the house.
jbo: le purdi cu trixe le zdani

source: The word "sam" is short for "computer" in Lojban.
jbo: zo sam rafsi zo skami fo lo jbobau

source: He takes pride in his work.
jbo: ko'a jgira lo su'u ko'a gunka

source: Many Chinese people consider red to be the best colour.
jbo: so'i jugypre cu jinvi lodu'u lo xunselska cu pamoi loi selska loka xamgu

source: What's the reason?
jbo: ma krinu

source: What would you like me to do?
jbo: do djica lo nu mi mo

source: I like the sun a lot.
jbo: mi mutce nelci lo solri

source: The woman is beautiful.
jbo: le ninmu cu melbi

source: This is a weird sentence.
jbo: dei cizra jufra

source: It disgusts me.
jbo: mi se rigni

source: The drumming of his fingers was thunderous to Alicia's sensitive ears.
jbo: le nu ko'a xandegda'i cu simlu lo ka lidysna kei le la .alisi,ys kerlo noi tcega'e

source: I like snow a lot.
jbo: mi mutce nelci lo snime

source: This afternoon the weather is going to get worse.
jbo: ca lo zi lecydo'i lo tcima ba xlabi'o

source: I had a relaxing talk.
jbo: mi surla lo nu mi tavla

source: I'm having a relaxing talk.
jbo: mi surla lo nu mi tavla

source: I relax myself by talking.
jbo: mi surla lo nu mi tavla

source: I need some sugar.
jbo: mi nitcu lo sakta

source: He was a good friend.
jbo: pu xamgu pendo

source: Is it difficult eating with chopsticks?
jbo: xu se nandu lo nu citka sepi'o lo cticinza

source: Careful, the man has a gun.
jbo: ko kurji ki'u lo nu lo nanmu ku ralte lo celxa'i

source: Be quiet while we're eating.
jbo: ko smaji ca lo nu ma'a citka

source: He can speak Japanese.
jbo: pu'i se bangu lo banjupunu

source: I feel good.
jbo: ui

source: The cause of the fire was unknown.
jbo: na djuno fi lo rinka be lo fagri

source: "How old are you?" "I'm 16 years old."
jbo: do ma nanca .i li paxa

source: My name's Jack.
jbo: mi'e.djak.

source: Sysko hangs around in secret pubs at night.
jbo: la.siskos. stali lo selmipri barja ca lo nicte

source: Tell a beautiful story to my young friend.
jbo: lo melbi cu lisri fi ko lo citno pendo be mi

source: Can I speak with Bill?
jbo: xu mi ka'e tavla la.bil.

source: I am afraid of offending you.
jbo: mi terpa lo nu cnixai do

source: Hi! Where do you want to go?
jbo: coi .i djica lo nu klama ma

source: The result won't really be good.
jbo: le jalge no'e xamgu

source: Is mercury really a metal?
jbo: xu lo margu cu jinme da'inai

source: Did you understand what he meant?
jbo: pei do jimpe lo du'u ra te smuni makau

source: She became a police officer.
jbo: ra binxo lo pulji

source: His theory is difficult to understand.
jbo: lo nu jimpe fi lo sidbo be fi ra cu nandu

source: My friend is seventeen years old.
jbo: tu'a lo pendo be mi cu nanca li paze

source: My friend is seventeen.
jbo: tu'a lo pendo be mi cu nanca li paze

source: Can I ask some questions?
jbo: xu so'u da ka'e preti

source: She got very angry with her children.
jbo: ra mutce fengu lo panzi be ri

source: His house is very far from the station.
jbo: lo zdani be ra cu mutce darno lo tcana

source: Tatoeba: Because a language is more than the sum of its words.
jbo: la.tatoebas. zo'u se krinu lo nu lo bangu cu zmadu lo sumji be lo valsi

source: He returned at six.
jbo: ra se'ixru ti'u li xa

source: She speaks English fluently.
jbo: ra filta'a fo lo glico

source: We'll go when it stops raining.
jbo: mi'o klama ca lo nu co'u carvi

source: Would you like to become a trusted user?
jbo: e'u pei do binxo lo selylacri cmima

source: What does "Tatoeba" mean?
jbo: ma smuni la'o zoi Tatoeba zoi

source: What does TATOEBA mean?
jbo: ma smuni la'o zoi Tatoeba zoi

source: My English teacher has advised me to read these books.
jbo: lo glico ctuca be mi ba'o stidi lo nu mi tcidu loi vi cukta

source: Do the people of your country eat rice?
jbo: xu lo'e se gugde poi do cmima cu citka lo rismi

source: I know that you know that I know.
jbo: mi djuno lo nu do djuno lo nu mi djuno

source: If you flunk this exam, you'll have to repeat the course.
jbo: ganai do fliba le cipra gi do reftadni

source: My basket is full of books.
jbo: .i lo mi lanka cu culno lo cukta

source: Find multilingual sentence equivalents at Tatoeba.org.
jbo: .e'u ko facki fi lo mitsmu jufra be bau sorbau ra'i la'e zoi kib tatoeba.org kib

source: This is a random sentence from Tatoeba.
jbo: ti cunso jufra ra'i la.tatoebas.

source: How much have you paid for this computer?
jbo: do terve'u lo vi skami fo ma

source: This dog is yours.
jbo: lo vi gerku cu selpo'e do

source: Hi. How are your doing?
jbo: coi do zukte ma

source: Because of these trees, he can't see the forest.
jbo: ki'u tu'a lo vi tricu ku na kakne lo nu viska lo ricfoi

source: Please add more coffee.
jbo: e'o ko ckafi zengau

source: I lived in Rome.
jbo: mi pu xabju la rom

source: The typical Japanese person doesn't speak English.
jbo: lo'e ponjo na se bangu lo glico

source: The boy eats bread.
jbo: lo nanla cu citka lo nanba

source: The man ate bread.
jbo: lo nanmu pu citka lo nanba

source: The woman drinks water now.
jbo: lo ninmu cu pinxe lo djacu ca ku

source: The girl buys milk at the market.
jbo: lo nixli cu terve'u lo ladru bu'u lo zarci

source: The people don't buy milk at this market.
jbo: loi prenu na terve'u lo ladru bu'u lo vi zarci

source: Yesterday I listened to a very beautiful song.
jbo: ca lo prulamdei mi tinju'i lo melbi selsa'a

source: His sister can't talk to you today.
jbo: lo mensi be ra na ka'e tavla do ca lo cabdei

source: Death is the fate of all people.
jbo: ro prenu cu mrodimna

source: The teacher is going to start learning English this year.
jbo: lo ctuca co'a cilre fi lo glibau ca lo zi nanca

source: Stop that.
jbo: ko sisti

source: It's going to be violent weather!
jbo: .a'e ba vlile tcima

source: I'd like to add a new language in Tatoeba, what do I have to do?
jbo: mi djica lo nu jmina la.tatoebas. lo cnino bangu .i .ei mi zukte ma

source: How can I become a trusted user?
jbo: ta'i ma mi ka'e binxo lo selylacri pilno

source: This pencil is better than that one.
jbo: lo vi pinsi cu xauzma lo va co'e

source: Nobody knows the truth.
jbo: no da djuno lo jetnu

source: Let's speak Vabungula and Yuelami!
jbo: sai e'u tavla fo la'oi Vabungula je la'oi Yuelami

source: Cockroaches are insects.
jbo: lo jalra cu cinki

source: In other words, you're a fool.
jbo: .va'i do bebna

source: Juliet talked to Romeo on the balcony, who was outside.
jbo: la juliet. bu'u lo balni cu tavla la noi bartu romeon

source: Japanese are Asians.
jbo: lo ponjo cu xazdo

source: The users of Tatoeba are kind.
jbo: le'e cmima be la tatoebas cu xendo

source: I see the girl is beautiful.
jbo: za'a le ninmu cu melbi

source: This man is dead.
jbo: lo vi nanmu cu morsi

source: She is both rich and very beautiful.
jbo: ko'a ricfu gi'e mutce melbi

source: Why are you angry?
jbo: mu'i ma do fengu

source: I'm sure she is going to sing at church tomorrow.
jbo: mi birti lonu ko'a ba sanga bu'u lo malsi ca lo bavlamdei

source: I hurt my thumb doing a handspring.
jbo: oi mi cortu lo xantamji ca lo nu xance plipe

source: The fish was swimming in the water.
jbo: lo finpe pu ca'o limna lo djacu

source: I have a house.
jbo: mi ralte pa lo zdadi'u

source: Yes, that's my house.
jbo: .ie ti mi zdadi'u

source: No, that's not my house.
jbo: go'inai .i ta na zdani mi

source: Yes, you love me.
jbo: ie do mi prami

source: Don't come.
jbo: ko na klama

source: Don't go.
jbo: ko na klama

source: I can fly.
jbo: mi ka'e vofli

source: I will sing while he is resting.
jbo: mi ba sanga ca lonu ko'a ca'o surla

source: They are talking about what they will sing.
jbo: da casnu lo ba selsa'a be da

source: I dreamed about you.
jbo: mi senva tu'a do

source: Please let go of my arm.
jbo: e'o ko mo'u jgari lo birka be mi

source: You can remove the NNC.
jbo: do ka'e vimcu la'o zoi nynycy zoi

source: How could there be unbroken eggs under a toppled nest?
jbo: ta'i .uanai ma lo nalpo'i cpiso'a ku cnita lo farlu cpizda

source: A list of required hardware is available here.
jbo: lo nu do cpacu lo liste be lo'i sarcu cabra ti cu selcru

source: She has big boobs.
jbo: ra zo'u lo tatru cu barda

source: I'm a Japanese teacher.
jbo: mi ctuca fo lo ponbau

source: This bus is going to Minsk.
jbo: ti lo basfa ku klama la minsk

source: I think I'm gonna stay here.
jbo: sei mi jinvi mi te mukti lo ka vi stali

source: I can't.
jbo: mi na kakne

source: It's not blood. It's beet.
jbo: ti na'e ciblu gije betka

source: I'm sick.
jbo: mi bilma

source: That's not a bear anymore. That's bear goo.
jbo: ta ba'o cribe .i ta cribe pesxu

source: It makes sense.
jbo: ti racli

source: I like Japanese very much.
jbo: mi mutce nelci tu'a le ponbau

source: The method is wicked.
jbo: le tadji cu palci

source: He looks forward to having 200 visitors.
jbo: ra kanpe lo nu renono vitke cu zvati

source: He made a pack for the clothes, bound together with rope.
jbo: ra zbasu lo bakfu be lo taxfu bei lo skori

source: I hate chalk. It leaves powder on your hands.
jbo: mi xebni lo bakri .i oi punji lo purmo lo xance

source: Give me the metal bucket with the oil in it.
jbo: ko dunda lo baktu be lo ctile bei lo jinme

source: Where is the vodka?
jbo: le xalkrvotka cu zvati ma

source: She planted the flower bulb in the garden.
jbo: ra sombo lo balji be lo xrula lo purdi

source: The boss strolled around the balcony above the office, observing the workers.
jbo: lo gunja'a pu cadzu lo balni be lo brilu se ga'a loi gunka

source: The tip of the knife blade is sharp.
jbo: lo balre be lo dakfu cu kinli lo jipno

source: The tip of the knife is sharp.
jbo: lo kinli cu jipno lo dakfu

source: Please don't worry.
jbo: e'o ko na xanka

source: He suddenly became very happy.
jbo: ra suksa binxo lo gleki

source: I decided to learn Esperanto today.
jbo: ca lo cabdei mi jdice lo du'u tadni la.esperanton.

source: How did you learn Esperanto?
jbo: ta'i ma do tadni la.esperanton.

source: It's not difficult to learn Dutch.
jbo: lo nu tadni lo baurnuludu na nandu

source: Don't pay attention to him.
jbo: ko na jundi ra

source: It's shaking! Ah!
jbo: desku .iicai

source: Thank you so much! I am alive.
jbo: ki'esai .i mi jmive

source: A lot of buildings collapsed in Japan due to the earthquake yesterday.
jbo: ca lo prulamdei bu'u lo ponjo ri'a lo tedydesku .oicai so'i dinju pu porpi

source: Sadly, many Japanese people died.
jbo: .uinai so'i ponjo pu mrobi'o

source: There's going to be a tsunami!
jbo: .a'e ba vilxasybo'a

source: I am a Muslim.
jbo: mi muspre

source: Play the Humppa!
jbo: zgikrxumpa ko

source: What do you think?
jbo: do pensi ma

source: Come on, Arianna, speed up or we'll never get there!
jbo: .e'e sai doi .ari'anas. ko sutyze'a .i se va'o nai bo mi'o ba no roi tolcliva

source: Elephants are several times the size of mice.
jbo: lo xanto cu zmadu lo smacu lo ka barda kei lo pilji be li so'o

source: Look, my house is not as dirty as yours.
jbo: ko catlu .i lo zdani be mi na toljisyzma lo co'e be do

source: She always believes me.
jbo: ra ro roi krici tu'a mi

source: "A cat?" asked the old man.
jbo: lu xu mlatu li'u preti fi lo tolci'o nanmu

source: About that matter, how did it go?
jbo: da bi'unai jai pu mo

source: Yes!
jbo: .ie cai

source: I'm feeling very agreeable.
jbo: .ie cai

source: I'm feeling very much in agreement
jbo: .ie cai

source: She's beautiful.
jbo: ra melbi

source: She's pretty.
jbo: ra melbi

source: That will happen later.
jbo: la'e di'u balvi

source: It will probably rain.
jbo: lakne carvi

source: I want to be you.
jbo: .au mi me do

source: Why is she angry?
jbo: mu'i ma ra fengu

source: Why are they angry?
jbo: mu'i ma ra fengu

source: My thanks in advance for not opening the windows.
jbo: mi ckire fi lo nu ba na'e kargau lo canko

source: Why are you meowing?
jbo: .a'u mu'i ma do latcmo

source: What compels you to meow?
jbo: .a'u mu'i ma do latcmo

source: If you speak Klingon, I won't understand.
jbo: do tavla bau lo bangrklingo .inajanai mi jimpe

source: Does a Roman cat have a Roman meow?
jbo: xu lo mlatu pe la romas. latmo latcmo

source: My spoon is very large.
jbo: lo smuci pe mi mutce barda

source: Install Linux!
jbo: ko samse'a la.linuks.

source: Eat the bread!
jbo: ko citka loi nanba

source: Yesterday my brother went to Fukushima to help the inhabitants. I'm afraid that the radiation will increase.
jbo: ca lo prulamdei lo bruna be mi cu klama la fukucimas. mu'i lo nu sarji le xabju .i mi xanka lo nu zenba lo ni seldi'e

source: In the end, they approved the proposal.
jbo: sei jalge ko'a pu zanru lo selti'i

source: They asked Mrs. Lincoln where she wanted her husband buried.
jbo: za'u ko'a pu reisku fi la misis linkoln fe lo se du'u ri djica lo nu lo speni be ri cu se derni'agau bu'u makau

source: He liked making decisions.
jbo: ko'a pu nelci lo nu jdice

source: He was able to reduce taxes.
jbo: ko'a kakne lo nu jdika lo cteki

source: He had suffered some failures.
jbo: ko'a pu ba'o lifri lo nunfli

source: He was a former university professor and researcher.
jbo: ko'a pu balkulctu je datnysisku

source: He went to the house where the president's body lay.
jbo: ko'a klama lo zdani poi le morsi gugja'a cu zvati

source: He could not return to his home in the New York area.
jbo: ko'a na kakne lo nu xruti lo ko'a zdani be vi la .nu,iork.

source: He said he regretted what had happened.
jbo: ko'a cusku lo du'u xenru

source: What are your top ten favorite movies?
jbo: pano ma poi skina cu traji co se nelci do

source: Do I exist?
jbo: mi zasti xu

source: Do you exist?
jbo: do zasti xu

source: Does he exist?
jbo: ko'a zasti xu

source: Do we exist?
jbo: xu ma'a zasti

source: His memory will live forever.
jbo: lo nu ra morji cu ranji ro zo'e

source: Where are we meeting tomorrow? I don't want to get lost again.
jbo: bu'u ma mi'o pensi'u ca lo bavlamdei .i .au mi na za'u re'u farcri

source: The plan did not succeed.
jbo: le selpla na pu selsnada

source: I do not want your houses.
jbo: mi na djica lo nu ponse lo do'o dinju

source: McClellan decided to wait.
jbo: la.miklel,n. jdice lo nu denpa

source: The two men had much in common.
jbo: lo'i re nanmu cu tcesmisi'u

source: Settlers were forced off their land.
jbo: pu livbai le xa'urbi'o le ri tutra
